app/views/gossips/show.html.erb

                     <p class="card-text"><%=  @gossips.content %></p>
                     <p class="text-right"><%= link_to @gossips.user.first_name , profile_path(:id => @gossips.user.id)%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]