app/views/welcome/show.html.erb

SELECT "gossips".* FROM "gossips"
---
            <div class="row mb-3">
               <% Gossip.all.each do |gossip|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
                                 <a class="p">
                                 <%= link_to gossip.user.first_name, profile_path(:id => gossip.user.id) %>