app/controllers/profile_controller.rb

  def show
    @user = User.find_by(:id => params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]