app/views/cities/show.html.erb

      </section>
      <% Gossip.all.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips"

                     <a class="p">
                                 <%= link_to gossip.user.first_name, profile_path(:id => gossip.user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]