app/views/profile/show.html.erb

         <h3 class="mt-4 mb-4">Les confidences de <%= @user.first_name %>:</h3>
         <% @user.gossips.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 6]]